[{"asin": "B00ASURUYQ", "name": "Apple iPhone 5 16gb Unlocked Cellphone - Black", "ratings": {"2 star": "5%", "1 star": "27%", "4 star": "13%", "3 star": "8%", "5 star": "47%"}, "url": "http://www.amazon.com/dp/B00ASURUYQ", "price": "", "reviews": [{"review_header": "Buyer Beware!!", "review_id": "R1BXB47BCE5YLS", "review_author": " Charleen N.", "review_text": "Buyer beware!!! This was my first iPhone purchase, and it was advertised New, Unlocked A1428 it looked new, long story short, I was extremely embarrassed when I took my iPhone to my carrier At&t, had it turned on and within an hour when making my first call At&t cut in and said we are sorry but, this phone was reported stolen, I said how could that be I just bought it all nice in a sealed box New that is not possible. Well they had me read the serial number and Part number on the box and it did not match what was on the phone, they also said if you know the last four numbers of the original owners phone number we may help you, I was mad I said oh really how would I know that you told me the phone is stolen now adding salt to injury they then suspended my account thinking I stoled the phone. Well I went down to the Apple store to see what they could do for me since it is a Apple product. 1) they said iPhone 5 is not available (New) it is only refurbished and 2) they also confirmed that it was (stolen) and there was nothing I could do. Mean while I spent a good part of Mother's Day trying to convince At&t that I am a victim here, that I did not steel the phone and pleaded with At&t to re-enstate my account with them, which they finally did. I just want my refund back and will pay extra at the Apple store.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "11 May 2015"}, {"review_header": "Phone still locked when received on 4/29.", "review_id": "R2ZTLOVFADWK38", "review_author": " Mike Trausch", "review_text": "It was advertised as \"unlocked.\" When the gift recipient received it, it was still locked. It cost and additional $125 to have it unlocked. This is false advertising. I would appreciate credit for the $125.", "review_comment_count": "", "review_rating": "3.0 ", "review_posted_date": "29 Apr 2015"}, {"review_header": "iPhone 5 16GB Black", "review_id": "RJSPYALC1MAK0", "review_author": " Monir", "review_text": "I am very glad to buy the phone from amazon. It is really nice phone. I gave it my brother Mr. Abul Kalam. He is very happy to get the phone.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "30 Jun 2015"}, {"review_header": "... it never mention that it had cracks really a waste of my money if your going to sell a ...", "review_id": "R5L1XEBCWQ55P", "review_author": " Amazon Customer", "review_text": "I purchase this iPhone for my daughter for her bday and now I have to send it back the phone is hard to put in charge u have to play with it also it doesn't stay charge and the phone is cracked by the camera leans which in the description it never mention that it had cracks really a waste of my money if your going to sell a used product at least be honest don't just take someone money knowing the phone is jacked up", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "20 Oct 2017"}, {"review_header": "One Star", "review_id": "R2CXEGQHNZ6BGW", "review_author": " poly de abreu", "review_text": "Phone used No garanty", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "20 Apr 2015"}, {"review_header": "One Star", "review_id": "R30CGD7E42DRUO", "review_author": " salmama", "review_text": "Bought brand new in April 2016. Died exactly a year later.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "02 Dec 2017"}, {"review_header": "Four Stars", "review_id": "R1UH640CV5MIVK", "review_author": " Nezar", "review_text": "good quality", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "19 Nov 2016"}, {"review_header": "Phone was in good condition and I just needed something quick", "review_id": "R5RVVJTL1WREP", "review_author": " S. Corn", "review_text": "Phone was in good condition and I just needed something quick. Not a bad deal. Hopefully it lasts a bit or at least til I can get something more current. Got it quick, good deal.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "14 Sep 2015"}]}, {"asin": "B00YD53JRO", "name": "Apple iPhone 5C 8 GB Unlocked, White (Certified Refurbished)", "ratings": {"2 star": "6%", "1 star": "24%", "4 star": "13%", "3 star": "6%", "5 star": "51%"}, "url": "http://www.amazon.com/dp/B00YD53JRO", "price": "", "reviews": [{"review_header": "PERFECT PRODUCT. Recommend buying from this seller.", "review_id": "R2JB3ZDSY6H3FO", "review_author": " Kaylee", "review_text": "I am so glad I bought this phone. It's honestly everything I was hoping I would get. The phone looks honestly brand new. Plastic on both the front and back of the phone. It was shipped FAST. Took 2 days to come in when I picked regular speed. The is indeed unlocked. I was able to activate it with metro pcs. I am so grateful and glad I found this. You are a trusted seller and if im looking for a phone in the future, im 100% coming to this seller. Thank you again.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "01 Aug 2015"}, {"review_header": "... of receiving this phone because of all of the bad reviews but once I'd gotten the phone", "review_id": "R3IJRODNV3N248", "review_author": " Lala J.", "review_text": "I was scared of receiving this phone because of all of the bad reviews but once I'd gotten the phone. OMG! nothing was wrong with it and I had no problems. I waited a few months before I wrote a review and the phone is still in working condition!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Jun 2016"}, {"review_header": "love apple", "review_id": "R3E4WFAE22YYZF", "review_author": " glenn", "review_text": "this looks new and came in 2 days and works just as a new one should, love apple stuff", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "20 Jun 2015"}, {"review_header": "I love it. It's worth the money", "review_id": "R1S9OVDIUACYUM", "review_author": " Deadrienne", "review_text": "this phone is brand-new . I love it. It's worth the money!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "03 Jul 2015"}, {"review_header": "Great buy", "review_id": "R3S6ILEG16BPXH", "review_author": " Efua Dennis", "review_text": "It looks brand new! Comes with a charger and plastic film on both sides of the phone. Shipped quickly.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "26 Jun 2015"}, {"review_header": "Great phone at a great price", "review_id": "R3IV10DHZKLF2O", "review_author": " Rthienes", "review_text": "My daughter has been begging for an iPhone 5 for years. This year for her sweet 16, she got one. The phone was indistinguishable from a new phone and is in perfect working order.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "06 Mar 2017"}, {"review_header": "Currently on my 2nd replacement. Had some hardware issues ...", "review_id": "R2FAEARMJM8T9G", "review_author": " Karen Rodriguez", "review_text": "Currently on my 2nd replacement. Had some hardware issues with the first phone, second one was blacklisted, and this third phone seems to be running smoothly so far. Larry the customer manager has been very flexible with working out the phone issues. Thank you so much!", "review_comment_count": "", "review_rating": "3.0 ", "review_posted_date": "20 Sep 2015"}, {"review_header": "Crummy batteries", "review_id": "R3253OAXW80XJR", "review_author": " Nunya", "review_text": "Purchased two of these and both of them are sporting some pretty short battery life! We get less longevity from these than we did with our 3 year old 4S's we handed \"down\" to our kids. Lame. They don't seem to process information any better either. They work, but I am underwhelmed considering how much \"smart\" phones cost.", "review_comment_count": "", "review_rating": "2.0 ", "review_posted_date": "12 Sep 2016"}]}, {"asin": "B00YD54GG2", "name": "Apple iPhone 6 Plus, GSM Unlocked, 16GB - Gold (Certified Refurbished)", "ratings": {"2 star": "6%", "1 star": "28%", "4 star": "10%", "3 star": "5%", "5 star": "51%"}, "url": "http://www.amazon.com/dp/B00YD54GG2", "price": "$327.95", "reviews": [{"review_header": "Certified refurbished is false advertisement.", "review_id": "R3R03VWZVTY5Y5", "review_author": " KM", "review_text": "Screen not working. No warranty and when I took it to the Apple store they told me the previous owner had a long history of repairs and even they knew the screen wasn't working. Certified refurbished is false advertisement.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "30 Sep 2016"}, {"review_header": "Great!!!!", "review_id": "R23XYIY2CUT2L1", "review_author": " Asia", "review_text": "I ordered the phone February 10th and recieved it February 16th. Straight talk works great with the phone and it is GSM Unlocked. Everything works fine , my only concern at first was the volume was low on the reciever, I found out i needed to remove the screen protector to hear it better or to turn on hearing aid mode. It came with a charger but no headphones also. the phone didnt come with the blue marks on it either , I put a blue marker on tape to change my LED color. 😍", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "17 Feb 2016"}, {"review_header": "Phone works great! I was a bit nervous about ordering it ...", "review_id": "R19RKSKT2DBOO1", "review_author": " Amazon Customer", "review_text": "Phone works great! I was a bit nervous about ordering it at first, but I'm so glad that I did! 😊", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "23 Nov 2016"}, {"review_header": "Excellent phone! Just as described (unlocked and ready to ...", "review_id": "R3U8TTC0OX7NWZ", "review_author": " Shawn Harding", "review_text": "Excellent phone! Just as described (unlocked and ready to use) Very satisfied customer. I only gave it four stars because I wished that it had come with all the additional accessories which is no fault of the seller! I would certainly purchase again.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "22 Mar 2017"}, {"review_header": "Five Stars", "review_id": "R3LRBCWF0DIOE6", "review_author": " Christian", "review_text": "Everything was fine", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "19 Feb 2017"}, {"review_header": "My son loves his IPhone - bought this unlocked phone ...", "review_id": "R1JJEH3UGZDIW7", "review_author": " Laura Feinstein", "review_text": "My son loves his IPhone - bought this unlocked phone with a lot of memory because he plans on keeping it for a long time", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "24 Apr 2017"}, {"review_header": "All that image and some. Don't know how I ...", "review_id": "R4AIDATS46PKZ", "review_author": " lookintheheart", "review_text": "All that image and some. Don't know how I lived without it all these years. All the money 💰 I spent on Android devices, I could have owned 3 iPhones 😊", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Jan 2017"}, {"review_header": "Great!!", "review_id": "R3RRABTSCIBK2G", "review_author": " Latasha", "review_text": "We loved the packaging and the thank you card that came in along with it. It works great and it looks amazing. Thank you for being legit 💯", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "10 Aug 2017"}]}, {"asin": "B01N9YOF3R", "name": "Apple iPhone 7 , GSM Unlocked, 32GB - Rose Gold (Certified Refurbished)", "ratings": {"2 star": "4%", "1 star": "24%", "4 star": "10%", "3 star": "4%", "5 star": "58%"}, "url": "http://www.amazon.com/dp/B01N9YOF3R", "price": "$492.93", "reviews": [{"review_header": "I would not recommend this product to anyone", "review_id": "R3OWZ6I3BM2P2U", "review_author": " Fabricio cortez", "review_text": "I would not recommend this product to anyone. It came scratched, with imitation charger that didn't work, no accessories at all. Don't loose you money.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "16 May 2017"}, {"review_header": "Five Stars", "review_id": "R1XKR4TT0NJVY3", "review_author": " Patricia", "review_text": "Good condition item", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "11 Dec 2017"}, {"review_header": "Defected camera", "review_id": "R360CK64T3ZDEU", "review_author": " kirby breault", "review_text": "Awful. Paid $510 to get a defected camera that does not work. Would not recommend buying from this 3rd party seller. Every time I try to take a picture my phone freezes. Have been trying to reach out to the seller for awhile now and have been unable to contact them.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "10 Dec 2017"}, {"review_header": "Five Stars", "review_id": "R18UGO6KSV6XMH", "review_author": " Arael", "review_text": "I love it!!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "27 Nov 2017"}, {"review_header": "Phone not carrier unlocked.", "review_id": "R248ZF5QZLS2GY", "review_author": " Ashtin Hill", "review_text": "When the phone arrived it was not carrier unlocked. However the customer service was great for returning it.", "review_comment_count": "", "review_rating": "2.0 ", "review_posted_date": "21 May 2017"}, {"review_header": "Don't buy!!!!", "review_id": "RZZL8ZEPZVJKE", "review_author": " Jessica", "review_text": "HORRIBLE!!! Went to the store to activate phone only to find out it was reported as stolen. Does not come in original box nor with original accessories. Only thin received was phone a cable and charger box", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "23 Aug 2017"}, {"review_header": "Speaker wasn't work in or out had to returned Amazing should be reserving this phone back 06/2/17 not to ...", "review_id": "R1XWJYFNORC37U", "review_author": " Amazon Customer", "review_text": "Speaker wasn't work in or out had to returned Amazing should be reserving this phone back 06/2/17 not to happy with the out come", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "01 Jun 2017"}, {"review_header": "Fully Satisfied! I recommend this dealer", "review_id": "R2M2ZH63OXOXQR", "review_author": " Bharath Challa", "review_text": "Excellent phone! Not even a scratch on it! Only drawback is that,it has come without a box and earphones or a connector and an original iPhone charger!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "24 Jul 2017"}]}, {"asin": "B075QJSQLH", "name": "Apple iPhone 8 4.7\", 64 GB, Fully Unlocked, Gold", "ratings": {"2 star": "3%", "1 star": "36%", "4 star": "18%", "3 star": "4%", "5 star": "39%"}, "url": "http://www.amazon.com/dp/B075QJSQLH", "price": "$824.98", "reviews": [{"review_header": "It's okay but it's no Android", "review_id": "R3F5I1IUM04TRI", "review_author": " Lantana Al", "review_text": "I \"upgraded\" from an LG G5 Android phone to an iPhone 8 Plus running iOS 11.0.3. Some things were better and some were not. While my family has had many Android and iOS devices, the iOS devices cost more but generally get (much) more use, plus they hold their value better. My favorite Android device (which has gotten a lot of use) has been my phone (an LG G2, then G4, then G5). UPDATE: I ended up returning the iPhone 8 Plus and getting a Pixel 2. There was just too much missing from iOS and the iPhone that Android had plus I was disappointed with the camera. I think the iPhone 8 is a decent phone but it's not for me (even though I use iPads). Read below for more. TIP: Don't buy mobile phones from Best Buy as they charge restocking fees. Hardware comparisons: * The G5 was much cheaper than the iPhone. * The G5 has a user replaceable battery and microSD slot. * The G5 is not waterproof but the iPhone is. * The G5 has dual cameras and one is a wide angle lens... I will miss the wide angle lens. * The G5 has fast charging and includes the needed cable and power adapter to do so. The iPhone 8 supposedly also has fast charging, but it will cost you $$$ to buy the needed cable and power adapter. * The G5 has a small color charge/notification LED which is nice. The iPhone can use the flash for alerts (General->Accessibility->LED Flash for Alerts). * The G5 photo aspect ratio is 16:9 and the iPhone's is 4:3. I *MUCH* prefer 16:9. Disappointed. * My G5 developed a focusing problem with the main camera where photos would often be blurry, which is what prompted me to start researching new phones. * The iPhone 8 Plus also has dual cameras, but no wide-angle camera... however, you get a 2X optical zoom camera and portrait mode photos which I am looking forward to. * The iPhone 8 has (slow) wireless charging but the G5 does not. * The iPhone 8 has 3D Touch but the G5 does not. * The iPhone feels like high end hardware, has a great IPS screen, and has great build quality but it's a little on the heavy side. The G5 is good too but doesn't seem quite up to the iPhone. * The glass back worries me but Consumer Reports says it is a rugged phone and survived their \"tough 100 drops in the tumbler with just some minor scratches\". iOS/iPhone negatives: * Speech recognition is not as advanced but it's not terrible either. * Speech recognition does not give you options to choose from a list of phrases of what you might have said. * I found it virtually impossible to place the cursor in the middle of a word when editing text. Very annoying. * Sometimes when I tap something it doesn't respond and I have to tap it again. This seems to happen mostly on small buttons. I didn't have this issue on the G5. * No always on display feature to show time and notifications. Many Android phones have had this for awhile, including the G5. Hopefully Apple will add this in an update as it's a very useful and convenient feature. * Can't configure bottom row of touch buttons. On Android, I had a button to quickly show and hide notifications. I found it better and faster than having to swipe down. * It seems Apple does not allow custom keyboards to access voice dictation... which means you have to switch keyboards to the standard one in order to access voice dictation. I use voice dictation a lot on my Android. * Home screen is not as configurable. Cannot control icon layout as much. * Some of my favorite apps (frequently used) are not available on iOS, like NOAA Weather and ColorNote. * You can turn on 'Reduce Motion' to limit animations that slow things down, but there are still some fades and other effects that you can't turn off. Android lets you turn off all (or almost all) \"eye candy\" animations for a faster phone. * Sharing photos to Google Drive made me always select the same folder (it didn't remember the selected folder). iOS/iPhone positives: * Frequent iOS updates. This is a big deal compared to most Android phones. * Easier to communicate with other people who also have iPhones (and there are a lot of them). * Can say \"Hey Siri\" to access Siri even when phone is laying down idle and without touching it. * Better security (so I've read). * Good integration across iPhones and iPads. * I like the way that news is integrated. So I returned the iPhone and bought a Pixel 2 because I like Android better when it comes to phones (although for tablets I use iPads). I really like the Pixel 2 but the LG G5 was great too although it did have some significant disadvantages (like updates). Pixel 2 notes: * It was very easy to connect my LG G5 to the Pixel 2 using the included cable to transfer data from my old phone to the new phone. There's also an included adapter in case you need it. Unfortunately I was disappointed that my alarms did not transfer and I had to re-enter them manually. I also had to re-arrange the icons the way I wanted. * The Pixel 2 screen and phone itself are a little smaller than my G5. I'd like a little larger screen like the G5 has but then the phone would be larger and weigh more so it's a trade-off. * No bloatware or crapware (especially the type you can't uninstall)!!! YEAH! And guaranteed 3 years of updates! These are BIG advantages of having Google phones. * So far the camera is impressing me. It's definitely better than the iPhone 8 Plus camera. I will still miss the wide angle camera on the G5 and the native 16:9 aspect ratio but portrait mode and the overall photo quality makes it much easier to forget. UPDATE: I noticed a quirk in portrait mode processing that didn't apply the blur properly around someone's hair... hopefully that will be improved/fixed. * Can turn off animations - I like to do this to make the phone feel even faster: https://lifehacker.com/disable-animations-on-android-to-improve-performance-1583554900 * The phone seems very fast, even when it was installing a bunch of apps in the background. It's the fastest and smoothest phone I've ever used. * The sound form the front-firing stereo speakers is best I've heard from a mobile phone. * I wasn't too happy there was no headphone jack, but I was pleasantly surprised that the headphone adapter seemed to be less intrusive than I anticipated and I am pretty certain that the sound quality through the adapter (which has a DAC in it) sounds better than my LG G5. I'll probably pick up an extra adapter or 2 (they are only $9 each) but are out of stock right now in the Google Store. Good audio video: https://www.youtube.com/watch?v=9Pi_SykMCsI * The always on display looks great with OLED, and this is a really nice feature that you don't get on iPhone. * I like that you can change icon shapes (square, circle, \"squircle\", etc.). * I found out my mobile data wasn't working. After a few hours researching and messing with stuff, I ended up having to use a new Tracfone SIM and getting my service transferred to the new SIM. * The Pixel 2 has a 'Now Playing' feature that listens to any music that's playing nearby and tells you the name and artist (even on the always-on display), but I'm not sure how practical it is. By the way, it works without mobile data and WiFi and without sending audio to Google. UPDATE: I went to Target and my phone was identifying the background music Target was playing. Pretty cool, especially if you've ever wondered what a song is that was playing. * Fast charging is great (especially when you need it), and the Pixel 2 includes a beefy fast charger. * I really like that Google increased the warranty to 2 years. With the extra 24 months I get with my credit card, that gives me a 4 year warranty. Too bad it doesn't cover accidental damage though. * The Google Assistant is tops when it comes to brains (smarts), and can be activated with a squeeze or by saying 'hey Google' or 'OK Google'. Pixel 2 Android disappointments (could be rectified with Android updates): * No battery life indicator on the 'always on' display (my G5 had this and it was useful). * My LG lets you customize the navigation bar but the Pixel 2 doesn't without a little \"hacking\" it seems. I really liked that I could add an extra button to pull down the notifications. Maybe they will add this in Oreo 8.1. * There is a double-tap feature to check your phone but unfortunately you can't double tap it to turn the screen back off (my G5 had this too)... this one is kind of nitpicky though.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "31 Oct 2017"}, {"review_header": "amazing phone seller overpriced!", "review_id": "R3MFZ9YP291CCA", "review_author": " Luke Milner", "review_text": "Amazing phone but the seller charges $30 more than the Apple store just go there to get it plus the warranty is better and you can always add Apple care if you choose! make sure to follow if you find reviews like this helpful!", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "06 Oct 2017"}, {"review_header": "Dead phone after 30 days. What follows next is sad...READ!!", "review_id": "R2VS3OA653I3KB", "review_author": " HOMEWORK", "review_text": "Got the iPhone 8 256GB. After about one month, the phone went (almost) dead. The home button would still \"click\", meaning the phone was technically \"on\", but there was no display and I was unable to reset which included briefly pressing the volume up, followed by volume down, followed by holding the right button for more than 15 seconds. I went to the apple store and was seen within 30 minutes (which was good). However, instead of giving me a new phone, they gave me a refurbished one. For this, I give 2 stars.", "review_comment_count": "", "review_rating": "2.0 ", "review_posted_date": "10 Dec 2017"}, {"review_header": "So far so good.", "review_id": "RSN9E3DYPFQA4", "review_author": " Nicole Del Sesto", "review_text": "So far I'm really happy with this phone, but i upgraded from a 5S so I guess it wasn't going to take much. I love LIVE PHOTO! I think that's a great feature. The size of the phone is perfect. Mom just got a 7 Plus, and as much as I would have loved to have the camera in that phone it's just too big. She downgraded to a 7, so I had a little experience with the 7 before choosing the 8 and I'm glad I spent the extra money. I love small differences make an impact like the \"touch\" of the phone (i.e. hold down to make the apps shake, and double click on home button to close apps). The sound is so much better than my 5S - It took some days to get used to how loud the phone is. Also had issues with saving my fingerprint which is no longer an issue with this phone. It's insanely expensive, but I'm thrilled with it.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "10 Oct 2017"}, {"review_header": "Fast and capable, but more than a smartphone alone", "review_id": "R2UG40F4UZ5TUE", "review_author": " M. Fitzhugh", "review_text": "I purchased an iPhone 8 64 GB from Ting after using an iPhone 5C for two years. I’m finding it super-fast and enjoyable to use. The screen is bright when it needs to be and dims well in the dark. It’s beautifully manufactured and Has a great camera that’s enhanced by really solid image processing built into iOS. Without doubt, the phone more expensive than it reasonably should be, but keep in mind that when you buy a high-end phone like this, you’re paying for more than the phone itself. You’re paying your part of the cost of running a global enterprise that vets the software available in the App Store for safety, provides a global secure text and voice messaging infrastructure, and invests constantly in developing the phone you’ll buy two to four years from today. Android phones are an awesome alternative, especially the mid-level phones that provide incredible hardware and software flexibility, often for as little as $250. But they’re not as joyful to use or as tightly tied to the Apple ecosystem. It’s a tough choice to make, but the good news is, it’s hard to go wrong. As someone who uses my phone all day long for a hundred different things, buying this phone was an easy call. If you just want a great smartphone and don’t care about the whole Apple universe much, then maybe look elsewhere.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "02 Dec 2017"}, {"review_header": "It'd be better if it comes with airpods", "review_id": "R3Q3ZTSWP2OSUF", "review_author": " Nicole Mn", "review_text": "Not very different from iphone 7, but an iphone is an iphone what can I say? It'd be better if it comes with airpods, I do need wireless earphone after earphone jack is removed. But anyways I'm happy with my Leophile wireless earphones, besides it is a lot cheaper", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "19 Oct 2017"}, {"review_header": "Five Stars", "review_id": "R3IFQFHC2AUSAW", "review_author": " avery wirt-eaves", "review_text": "Truly a beautiful phone. Much better than expected. Extremely happy with this purchase.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "10 Nov 2017"}, {"review_header": "Five Stars", "review_id": "R2OPNYSC875AHE", "review_author": " ifeanyi Onubogu", "review_text": "Arrived on time and as expected", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Dec 2017"}]}, {"asin": "B075QN8NDH", "name": "Apple iPhone X, Fully Unlocked 5.8\", 64 GB - Silver", "ratings": {"1 star": "30%", "4 star": "5%", "5 star": "65%"}, "url": "http://www.amazon.com/dp/B075QN8NDH", "price": "", "reviews": [{"review_header": "Five Stars", "review_id": "RE4M6IR3F4RWC", "review_author": " monica lee duran", "review_text": "Came on time and it was perfect ( box , cellphone) everything was perfect .", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Dec 2017"}, {"review_header": "From a 6S to an X - A wonderful, luxury, phone.", "review_id": "RKTKN3VZM6522", "review_author": " Taylor", "review_text": "I received my X on launch day and I absolutely love this phone. If you would like a list of just my thoughts on the phone, scroll down pass the introduction. The transition: NO home button! The staple of the iPhone is gone; well, moved to a little notch at the top. I was expecting this transition to a home-button-less iPhone to be difficult, but all of the gestures feel so natural. I find myself annoyed trying to utilized an older iPhone as the interface now feels clunky. Switching through apps, opening the phone, accessing everything, it's all so easy. Now, this isn't to say there isn't a transition and while everything feels natural, there is a period of time where you have to get used to the new interface and some aspects that initially seemed difficult become second nature. For example, reachability was a favorite feature of mine and while it was initially hard to activate, I have now learned how to activate it without an issue (reachability brings the iPhone screen down halfway to reach top parts of the screen without moving your hand). Face ID: I was skeptical to say the least, but Face ID works (almost) perfect. It does however learn from its missteps and if it fails to identify you, it will add that data to its cache. I personally scanned my face normally the first time and on the second scan did it at roughly a 45 degree angle so I could lean over my phone to view notifications. As I've adjusted to Face ID, it has gotten faster and faster at scanning my face and it's not something you need to wait on to open your phone. By the time you swipe up on your phone, it's unlocked and ready to go (I seriously forget I have a password). I also really enjoy the ability to utilize Face ID for my password for other logins and the ability to open up an app directly from the lock screen without having to then enter my fingerprint/passcode. It's important to note here that your privacy is well, yours. No one has access to the data Face ID gather's and it is truly yours. Apple has a good track record on keeping your data private as they are not in the data business (hello Google & Facebook). The price: There seems to be this running idea that a $1,000 phone is a crazy purchase, but I would have to disagree. Why? My logic is as followed: Phone's are one of the most used devices (easily mine) so for starters, I would like a nice one. If I didn't buy the device in full, I would have been paying roughly $2/ a day on a contract with Verizon. The base model is a 64GB iPhone loaded with the best Apple has to offer. A 128GB 6S at launch was $850. Yes, there's a price difference, but my point is that it's not as gigantic as it may seem. I personally would advocate a 64GB version and utilizing cloud storage if you need more space, but do note, this is Apple's flagship and there are cheaper iPhone's out there. What I love: - The screen looks amazing. The colors are vibrant, the blacks are deep with black wallpapers flowing aimlessly into the phone (to the point you cannot see the notch in the screen if the wallpaper is black). - The Notch! Yes, the notch. Some people seem to hate it, I think it's iconic and makes the iPhone X stand alone in oled sphere. It fades into the user experience and I have not had any issues with it. - The screen size. I have always wanted a plus, but I always felt like it was too big for my hands. That I would drop the phone and there it goes. The X remedies this for me and I get to use a larger screen in nearly the same form factor as my 6S. The screen truly looks amazing and if you haven't seen one, check one out at a local store. - I'm not sure how much of this is just because my 6S was a few years old, but the taptic engine in the X is amazing. As in, when the phone vibrates, I can easily identify what it is through the vibration and the vibration itself feels smooth. - Force touch is also fantastic and the haptic feedback on everything from a like on twitter to moving apps around is wonderful. Makes the screen feel more three-dimensional in a way. - The camera takes wonderful pictures. I have taken a few pictures in portrait mode and some pictures genuinely look like they were taken with a DSLR camera. - The speakers are louder than I expected and sound very clear. Great for impromptu music listening. - The phone is a little heavy, but it is definitely comfortable to hold. It feels like a luxury device and has a certain weight to it. What I don't: Honestly, I do not have a genuine complaint at this point. The only complaint that comes to mind revolves around the lack of optimization I have faced in some apps, but that is a developer problem and even then, developers have optimized a majority of their apps and my issues have been few and far between.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Nov 2017"}, {"review_header": "Iphone X: A complete re-design and leap forward for Apple.", "review_id": "R1ENG94TAPGZ3N", "review_author": " V12 Vantage", "review_text": "Everyone reading this is probably familiar with the Apple phone line up so I am going to focus on the differences between the iPhone X and iPhone 7 plus specifically. First off, the set-up process has been significantly streamlined. When setting up your new iPhone X setup will ask you if your old iPhone is nearby, select yes, and you can wireless transfer all your apps, settings, backgrounds, passwords, etc. to your new phone in a few clicks. I really appreciated this streamlined process and it was incredibly quick and easy to transfer all my settings to my new iPhone X. The other main features that have been upgraded are as follows: New screen (5.8” OLED is the most vibrant and clear screen ever produced by Apple) - Apple has removed the touch ID sensor and bezel around the old iPhone screen which means the iPhone X has a noticeably smaller footprint while maintaining a larger screen size than the iPhone 7/8 Plus. (See comparison images attached of the iPhone X versus iPhone 7 Plus). - OLED Screen offers deeper blacks and brighter whites resulting in greater color reproduction. - Similar to the iPhone 8 and 8 Plus the iPhone X uses true tone technology to mimic the lighting conditions around it and adjust the white balance accordingly. - The notch cut out of the top of the screen is where Apple has included the face recognition sensors, front camera, and a host of other sensors. I thought this would be annoying but Apple has cleverly used the screen real estate on both sides to include the time, date, battery indicators, etc. Farewell Touch-ID, Hello Face-ID - Face-ID is Apples new facial recognition technology which has replaced the finger printer reader and home button in order to free up additional screen real-estate. This is new and only available on the iPhone X. - Apples facial recognition is light years ahead of Samsung or any other carrier. I have tested this flawlessly with glasses, a hat, and even in the dark. It is as simple as looking at your phone and swiping up from the bottom. - I was worried this feature would be inconsistent or frustrating but it has worked really well. The only time it is a bit more inconvenient is if the phone is sitting on your desk or a flat surface you kind of have to lean over a bit or angle the phone towards you to unlock it. - This super powerful new camera also enables the animoji features which maps your facial expressions to create a talking emoji. This is a fun feature but more a novelty than anything. - This same true-depth camera makes the iPhone X the ultimate phone for taking selfies. The new portrait mode allows the user blur the background, or even cut yourself out entirely and place yourself on a black background. Additional noteworthy features and changes: - The rear camera boasts a dual 12MP sensor array with improved aperture and wide angle lens with image stabilization. The increased aperture from 2.8 to 2.4 allows for better images in low light conditions. - Video capabilities have also approved as well to include 60p 4k video recording delivering clear, fluid images. - Increased audio quality and volume - Increased RAM size to 3GB and new Bionic Chip makes the iPhone X one of the most powerful smartphones are the market. - Updated design features glass back and sides which make the phone beautiful looking. A very welcome change in the normal design. - Battery life: The iPhone X boasts the largest battery in Apple history with a 2716 mAh battery which is a bit larger than the new iPhone 8 Plus. A full charge from 0-100% takes about 2 hours and 10 minutes in my testing. - In addition, wireless charging has finally been added to the new iPhone X, and 8 series phones. I have not tested this out but am excited to give it a try (Wireless charging pad is not included with the phone). Bottom line, the iPhone X is another smash hit from Apple. Every feature people were concerned about turned out to work flawlessly as usual. I have only had the iPhone for about 24 hours so it is early to leave a long-term focused review but so far the new iPhone X has lived up to the hype. The iPhone X may not revolutionize the smart phone industry but it is a welcome upgrade to the iPhone which designs were getting a bit dated. I am excited about Apples new strategy to release a flagship model and allow the new features to trickle down to next generation’s phones. If you have the money to spare you won’t likely be disappointed. My only complaint is the phone only comes in 64GB or 256GB basically forcing users to pay an extra $150 to get decent storage. Further, the beautiful glass back on the screen feels fantastic and has a great weight to it. However, a replacement screen will cost you $275+ and the back glass replacement is rumored to cost around $400. Essentially a single drop could result in a $700 repair bill. Unfortunately this means most phones will be shielded in a case and will not be enjoyed.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "06 Nov 2017"}]}, {"asin": "B01MQHADBT", "name": "Lenovo Premium Built High Performance 15.6 inch HD Laptop (Intel Celeron Processor 4GB RAM 500GB HDD, DVD RW, Bluetooth, Webcam, WiFi, HDMI, Windows 10 ) - Black", "ratings": {"2 star": "8%", "1 star": "26%", "4 star": "13%", "3 star": "11%", "5 star": "42%"}, "url": "http://www.amazon.com/dp/B01MQHADBT", "price": "$298.00", "reviews": [{"review_header": "I'm satisfied.", "review_id": "R2INQTIJTXIYYL", "review_author": " LooziAnna", "review_text": "I've had this laptop for a few months now. It works great. Battery power works well. A little slower response time than my desktop. The keyboard keys are a little more spaced out than the standard; I have to check to see that I'm hitting the return and shift keys correctly. The cursor button is not very responsive; I need to press it pretty hard to make it work, so have resorted to using a wireless mouse exclusively.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "17 Jan 2017"}, {"review_header": "Sucks.", "review_id": "R10EWZFIZ9XGJ6", "review_author": " Linda Denault", "review_text": "Worked well for the first 4 months. Screen will freeze, system slow and a few other issues. After retrying, it will work. Sucks.", "review_comment_count": "", "review_rating": "3.0 ", "review_posted_date": "08 Dec 2017"}, {"review_header": "Five Stars", "review_id": "RZPC53SMG23FD", "review_author": " Seth T.", "review_text": "Nice deal, solid pc, no issues out the box, great", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "16 Nov 2017"}, {"review_header": "Four Stars", "review_id": "R35SJ9QGWHIVJB", "review_author": " Amazon Customer", "review_text": "pc is great in good conditions and work very well.Delivery on time", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "28 Mar 2017"}, {"review_header": "Three Stars", "review_id": "RI9X3Z2R7D8KI", "review_author": " Felix Mote", "review_text": "It is a great laptop", "review_comment_count": "", "review_rating": "3.0 ", "review_posted_date": "12 May 2017"}, {"review_header": "Five Stars", "review_id": "R303NJTJTQ1KTZ", "review_author": " Gisselle Burgos", "review_text": "Excellent", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "04 Mar 2017"}, {"review_header": "Four Stars", "review_id": "R1ZY2A9M71N3EW", "review_author": " Las Vegas Rose", "review_text": "Excellent value for $260! EZ to operate and faster then I expected.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "05 Dec 2016"}, {"review_header": "I really do love the lap top but it's giving me a static ...", "review_id": "R373T9XG2EGSUV", "review_author": " Amazon Customer", "review_text": "I really do love the lap top but it's giving me a static noise when in play music and it freezes. can u tell me what causes that", "review_comment_count": "", "review_rating": "3.0 ", "review_posted_date": "08 Jan 2017"}]}, {"asin": "B01MQTJXWZ", "name": "Lenovo 110s Premium Built High Performance 11.6 inch HD Laptop pc Intel Celeron Dual-Core Processor 2GB RAM 32G eMMC Storage Webcam Bluetooth WiFi HDMI 1-Year Office Windows 10-White", "ratings": {"2 star": "9%", "1 star": "25%", "4 star": "12%", "3 star": "11%", "5 star": "43%"}, "url": "http://www.amazon.com/dp/B01MQTJXWZ", "price": "$192.74", "reviews": [{"review_header": "Would definitely recommend", "review_id": "R3RY85M7AL797G", "review_author": " kim", "review_text": "This is a great device considering the low price. It's not MacBook Pro, but it can really hold its own, and it's about one tenth of the price. I've tried other netbook-type devices in the past and they always had such limitations. This device operates just like a laptop, and allows the full functionality of MS Office, plays videos just fine, and allows for general Internet activities with decent performance and reliability. The keyboard is easy to type on, the screen is decent, it's lightweight yet feels fairly sturdy, and it's a device that just grows on you. After I first fired it up, I wasn't super impressed, but after using it a while, I am starting to really love it, and would recommend it to anyone who wants something for email, web surfing, watching videos, or even the full functionality of Word and Excel if you're a student or want to keep track of your finances.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "12 Dec 2016"}, {"review_header": "Recommended buy", "review_id": "R250BD9S9GBE94", "review_author": " minerva", "review_text": "Cute and small fits perfectly in my handbag. This product is decent for everyday simple office work and travel", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "03 Feb 2017"}, {"review_header": "it does everything my Dell D630 did only better with w/10 Screen is only an inch smaller each ...", "review_id": "R3JU69YK6OQAQP", "review_author": " Jerr", "review_text": "it does everything my Dell D630 did only better with w/10 Screen is only an inch smaller each side its fast, prints and so far does it all that I could want in a notebook", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "09 Jan 2017"}, {"review_header": "Perfect budget school/writing/media laptop!", "review_id": "R1Z5B3FK6AYACB", "review_author": " EposVox", "review_text": "The Lenovo Ideapad 110s is 2017’s answer to dirt cheap laptops from Lenovo. It’s only about $150 to buy, runs a full copy of Windows 10, hardly weighs anything, and has a nice keyboard – but it doesn’t exactly have the highest-end specs. The Lenovo IdeaPad 110s is the budget follow-up to last year’s 100s. This time they’ve upgraded from an Intel Atom processor to a full Celeron, 2GB of RAM and 32GB of onboard flash storage. You still have the basic plastic shell body, 11.6” 1366x768 TN screen with poor viewing angles, but decent quality straight on, and the full fold-out-to-flat hinges. But this time you get lower battery life, which is kind of a bummer. This is a laptop that’s perfect for a super budget school or travel writing laptop, but nothing more. The Intel Celeron processor, while likely to handle multitasking a little better, doesn’t really bring any new performance over last year’s model. In fact, the laptop scored lower on Google’s Octane benchmark than the 100s! It is worth noting that Octane is being retired by Google. Also last year’s model only came with N wifi, which is much slower than the current generation AC wireless standard. The new 110s has AC, though it’s only a 1x1 antenna. The 110s has a responsive and comfortable keyboard for long typing sessions. No numpad, but keys are appropriately arranged and spaced out for its size. Very easy to use. The screen is still nice and crisp for working in word, Google docs, or web browsing. But you won’t get a ton more out of this machine. No Photoshop design work, no video editing, nothing like that. The webcam is trash. The speakers are on the bottom. They’re stereo this time, instead of last year’s mono, but they’re not great. This time, the whole computer is just white. This is, theoretically, a more aesthetically neutral position to be in, but the solid white keyboard and hand rest are bound to start turning colors and looking pretty gross after a few months. I would not look forward to that. As far as media consumption goes, this is actually a pretty good machine. Via USB 3.0 external hard drive, I was able to smoothly play back 4k 60fps video files, 1080p 60fps video files, and a full raw BluRay rip MKV in the native Windows 10 Movies app with no hiccups. 8k proved to be a bit much for it, though. On YouTube, I was able to play back 1080p60, 1440p, and 4K with no dropped frames. But there are still plenty of moments when the computer becomes unresponsive or just downright sluggish to use. It’s a little Celeron with a mere 2GB of RAM - and that can only do so much. Now, you do have a full copy of Windows 10 on here, which adds a little flexibility over something like a Chromebook or something, and I feel it may be one of the last of its kind with Windows 10 S coming soon. If you’re looking for a sub-$200 laptop for basic office work, web browsing, and media consumption - the Lenovo 110s might be for you. It features a couple upgrades from last year’s 100s, and is still tiny and super lightweight.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "15 May 2017"}, {"review_header": "Super Pleased", "review_id": "R2TKTLK3V8NTA5", "review_author": " Amazon Customer", "review_text": "Not going to lie 95% of the reviews had me worried. However mine showed up on time, with everything working. I've had no issues, it's perfect for all the simple things I need it for.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "14 Feb 2017"}, {"review_header": "Terrible sloooooooooowwww.", "review_id": "R1MAO8KM47DRN1", "review_author": " Amazon Customer", "review_text": "I regret buying this one. I needed a small, travel laptop just for checking e mail and doing bank transfers but is so terrible slow that it is almost useless for that. Believe me: put more money and buy something else.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "27 Nov 2017"}, {"review_header": "It runs pretty well but doesn't have much room on it at ...", "review_id": "RDO2AP58HYSF0", "review_author": " Kristin Lignowski", "review_text": "It runs pretty well but doesn't have much room on it at all. I am always getting low memory notifications. Regardless, it still runs pretty smoothly with only a hiccup here or there. I use my external hard drive with it to make more room.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "12 Dec 2017"}, {"review_header": "You get what you pay for. And yes. ...", "review_id": "R2HYMWPFXXE2SJ", "review_author": " Amazon Customer", "review_text": "You get what you pay for. And yes...it’s disappointing considering the manufacturers reputation. for me, it is not user friendly", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "08 Dec 2017"}]}, {"asin": "B073W5LDKM", "name": "2017 Newest Dell Inspiron Flagship High Performance 15.6 inch HD Touchscreen Laptop PC, Intel Core i3-7100U Dual-Core, 8GB RAM, 1TB HDD, DVDRW, Bluetooth, WIFI, Windows 10", "ratings": {"2 star": "6%", "1 star": "38%", "4 star": "6%", "3 star": "6%", "5 star": "44%"}, "url": "http://www.amazon.com/dp/B073W5LDKM", "price": "$406.48", "reviews": [{"review_header": "The laptop works excellent.", "review_id": "R2NT3CQN0FH1KJ", "review_author": " Rastadiva", "review_text": "Quick delivery. The laptop works excellent.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "12 Dec 2017"}, {"review_header": "Trash.", "review_id": "R27M3XIBDPO1AL", "review_author": " Amazon Customer", "review_text": "One of the biggest rip-offs on Amazon. They portray this as a high-performance, incredibly capable laptop for sale on the site; but what shows up to your door will be markedly different. I sprung for the upgraded RAM (8GB), which was a total waste and obviously a cash grab, as I received a model that didn't even come with the 6GB which was advertised on the stock model. This is an entirely secondary complaint however, as the real issues come from it's garbage connectivity to WiFi, inability to stream even basic YouTube videos, and the succession of error messages and hoops which you would have to jump through to download relatively simple applications and processes. Long story short, they are selling an overblown, overpriced item that cannot and will not do what you bought it for. WOULD GIVE ZERO STARS IF POSSIBLE.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "07 Nov 2017"}, {"review_header": "Completely satisfied!!!", "review_id": "R12NGCUAZ0ZX8S", "review_author": " Jason Sudbur", "review_text": "I received my laptop today. It arrived on time and and in perfect condition. It's a great little machine. I look forward to adding a solid state Samsung Evo 850 drive. It only took about an hour to update the whole system. I'm very well pleased with the seller and product.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "20 Nov 2017"}, {"review_header": "Super Slow Junk Box.", "review_id": "R2DSMIY01P77L", "review_author": " Stac", "review_text": "What a steaming pile of poo. I researched and for the price this laptop was a great deal. Believe all the bad reviews. It locks up amazingly fast. I assumed it just needed updates and it would be fine.....nope. The laptop is like a turtle on the highway. If you give it a single direction and leave it alone sooner or later it'll get there. But if you try to do any two things at once *WHACK!!!! Semi-truck crushes you and your dead. Meaning either plug the laptop in and come back in a day while it sorts itself out or just hold the power button and pray next time this lead weight starts something positive will happen. Taking this pile back to the store tomorrow and wishing them the best of luck with it.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "21 Sep 2017"}, {"review_header": "This thing is literally a piece of garbage. I am really trying to find out how ...", "review_id": "R3DEMSXPAHO430", "review_author": " debora m menez", "review_text": "If I could give this computer is zero*I would the thing is slower than a snail going from your back door to your porch. This thing is literally a piece of garbage. I am really trying to find out how to get my money back and return it", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "08 Nov 2017"}, {"review_header": "Two days earlier than I expected it to arrive I am very pleased with my Laptop", "review_id": "R14XG49GKSFW9N", "review_author": " Lillie K.", "review_text": "I received my new Dell Flagship Laptop today. Two days earlier than I expected it to arrive I am very pleased with my Laptop. I am new to Dell Laptop 8GM. I usually buy HP,but, I was tired of replacing Hp. I like the color (Black). The key Board is easy to operate . I also am a fan of Touchscreen Again really like the Laptop. Thank You", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "01 Aug 2017"}, {"review_header": "Very disappointed. First and last time", "review_id": "R1NIQ3C75VESGR", "review_author": " Ramon Tirado", "review_text": "Received the \"2017 Newest Dell Inspiron Flagship Laptop\" two days ago and had to send it to Dell for a new hard drive. Very disappointed. First and last time.", "review_comment_count": "", "review_rating": "2.0 ", "review_posted_date": "27 Nov 2017"}, {"review_header": "garbage of the garbage", "review_id": "R28N8R33CCRG58", "review_author": " Andrew Y.", "review_text": "garbage of the garbage.... the whole blank new notebook i brought, but i found touch pad not working,, when get sleeping, can't wake up!!!!!! very very garbage,, my 11 years old laptop still working better then it", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "12 Dec 2017"}]}, {"asin": "B01N8U0046", "name": "HP 15.6-inch Premium Laptop PC, AMD Quad-Core APU 2.0GHz Processor, 4GB DDR3 RAM, 500GB HDD, Radeon R4 graphics, SuperMulti DVD Burner, HDMI, Windows 10", "ratings": {"2 star": "8%", "1 star": "17%", "4 star": "24%", "3 star": "10%", "5 star": "41%"}, "url": "http://www.amazon.com/dp/B01N8U0046", "price": "$309.00", "reviews": [{"review_header": "Respectable features and performance for everyday tasks, well-built name-brand laptop for low cost.", "review_id": "R3A8M66EH528PW", "review_author": " Adventurer", "review_text": "I got this as a back-up laptop after reading specs and reviews. Having been a user and builder of PCs for many years (my first was a tower I assembled with an Intel 386/33MHz CPU for just under $2k!) I have to be amazed at how the performance/cost ratio has advanced, especially at the lower end of the market. This HP model provides a lot for little $. Only the basic black case speaks of lower cost, yet the case is sturdy--and won't easily show fingerprints. Keyboard is very good. Thankfully, performance is respectable from the AMD processor, much better than expected at this price point. Videos play well; the standard resolution display is good. More: 500GB HD, USB3 and two additional two USB2 ports, HDMI, ethernet, memory card slot, LEDs for HD operation (which seem to be missing from some models in recent years). CD/DVD burner included along with a camera and microphone. RAM included is 4GB with an open slot to add more, if desired. One could replace its 500 GB drive with a SSD for faster performance, if desired, and then use the 500 GB drive for external storage. It's wireless works well: youtube videos played quite well even with another program running in the background. Downloaded programs installed quickly as did programs installed from DVD. Speakers are adequate yet audio quality was better than average using good headphones connected to the headphone/microphone jack. Unit runs cool; battery life is decent (3+ hrs?)--and the battery is replaceable. A SSD would further increase run time on battery power. The mouse pad is decent. What's not to like about this entry-level model for so little $?! Sure, I'd have liked a lighted keyboard and more stylish case, but I can hardly expect these features at this price point. All-in-all, so far I'm impressed with this laptop's value, features, respectable performance for everyday tasks for such low cost. Good job HP!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "26 Nov 2016"}, {"review_header": "My electronics device", "review_id": "R1G8ZVTX6HFU91", "review_author": " Amazon Customer", "review_text": "Thank you Conan_1985 I am using my laptop at this moment typing this message and I love the use of this laptop. I love the keys and the durability of this computer and the screen is big enough and for me not to squint and read the information.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "01 Dec 2016"}, {"review_header": "Great laptop for the price", "review_id": "R143SG6JU5IH4J", "review_author": " A. Sierra", "review_text": "I'm in college and needed an inexpensive laptop and found this one. It's great since it has 500gb of storage and CD drive which most laptops these days don't come with one. The computer itself is pretty fast and haven't had any problems. The keys and touch pad feel very responsive. Great inexpensive laptop that can do the job.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "10 Jan 2017"}, {"review_header": "I will give it 5 stars I bought this at best buy on a black Friday deal ($170 if you ...", "review_id": "R1MKS9KDQ0JZUM", "review_author": " OhDannyBoi", "review_text": "11-25-15 As of now, I will give it 5 stars I bought this at best buy on a black Friday deal ($170 if you can still grab one) Seems great so far, and exactly what you'd expect from a mid rang laptop. Even at retail price, this is still a great deal. The battery life seems to be about 5 hours with light usage. But the 500 gb hard drive, and the decent CPU makes it a nice computer for a first timer, college student, or someone who just needs to do some work on the go. It's pretty light and the keyboard is great (I'm real picky about keyboards, and this one is great to type on) Maybe in the future I'll buy a slightly bigger battery, but for now this laptop meets my expectations and hasn't given me any issues yet.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "25 Nov 2016"}, {"review_header": "Five Stars", "review_id": "RAV46RHIDO7MY", "review_author": " John Sziber", "review_text": "Item was as described and delivered in a timely manner.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "02 Dec 2017"}, {"review_header": "Four Stars", "review_id": "R2MDOD2SPR29XA", "review_author": " Might Steve", "review_text": "preforms as advertised.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "07 Nov 2017"}, {"review_header": "Four Stars", "review_id": "R1SMEK3SFAVL75", "review_author": " Brian S.", "review_text": "good value for the money", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "02 Dec 2017"}, {"review_header": "Great little computer for the money.", "review_id": "R12HMVF4M33450", "review_author": " Semvnacke Tafhvmken", "review_text": "Works great so far!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "06 Dec 2017"}]}, {"asin": "B074HDDH7B", "name": "2017 HP Premium High Performance Laptop PC 15.6\" HD+ Display Intel i3-7100u Dual-Core Processor 6GB DDR4 Memory 1TB HDD DVD+RW HDMI Webcam WIFI Bluetooth Windows 10-Gray/Silver", "ratings": {"2 star": "10%", "4 star": "40%", "5 star": "50%"}, "url": "http://www.amazon.com/dp/B074HDDH7B", "price": "$474.99", "reviews": [{"review_header": "AMAZING!", "review_id": "R1YG82KZLT3TY4", "review_author": " Cherylynn", "review_text": "This laptop is awesome! Very lightweight, nice sized screen. So far it's running great! It started talking to me as soon as I turned it on lol. My old laptop broke and as soon as I logged into my Microsoft account all my old computer settings were transferred to this new laptop! So happy with it! My old one was super heavy and hard for me to drag up and down the stairs to move rooms or take with me places but this one is the perfect size. I had an HP Pavilon but I like this one way more! Worth the price. **Update** I recently noticed a hairline crack in my screen in the bottom right corner, it's so small I never noticed it , it looks like a long dirty streak across the bottom of the screen, it's not hurting using it but not sure if it came like that and I just didn't notice it or if it was done after. The two things on it I don't like it the lid kinda slams closed so you have to shut it very gently and two the power button is really weird where it's very stiff and hard to push, I could see this being a problem down the road as I have heard people talking about issues with their power buttons not working when the computers get older. Luckily I got the 2 year warranty so if this crack gets worse I will have to get it fixed.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "18 Oct 2017"}, {"review_header": "Love it. Fast shipping", "review_id": "R3TDQCHDPD6WGL", "review_author": " Arlin Moya", "review_text": "I wish the computer had more Gbs but it works great. I am a veterinary medicine college student and this works great for my studies! It has windows 10 and microsoft word etc. I also love to play the sims4 and other games and this loads my game fast! I bought a separate usb drive to store my files and I love the computer. It is cute and the right size for me! This order came a day earlier and very fast!", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "09 Nov 2017"}, {"review_header": "Amazing. This is one of the best computers I ...", "review_id": "R1IFOL7GWJ5E9", "review_author": " Amazon Customer", "review_text": "Amazing. This is one of the best computers I have purchased in a very long time. Set up was very easy and I was able to connect within minutes. Still in the process of learning all the new features of windows 10. Highly recommended.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "20 Nov 2017"}, {"review_header": "For a home user or student who can live with 6 gigs of memory and wants lots of storage, this machine is a good buy.", "review_id": "R84LSHHCT6471", "review_author": " William P. Carlucci", "review_text": "This is my first on line computer purchase. Since I have set up the machine but have not used it, my review must be limited. First, the setup was easy. Second, the machine is pretty, and the screen is clear and sharp. The case does not appear to be quite as sturdy as my office business class laptop, but that machine cost more money. Speakers are very clear. For someone who wants a top notch business class machine with lots of memory, they will need to spend more money. For a home user or student who can live with 6 gigs of memory and wants lots of storage for photos, etc., this machine appears to be a very good buy.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "28 Nov 2017"}, {"review_header": "Great computer", "review_id": "R2K3WUSK4L0ROI", "review_author": " cartoon lover girl", "review_text": "Really good computer i have had it so far for 3 hours and it works fine it sets thing's up very well and i have no complications", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Nov 2017"}, {"review_header": "I'm speechless for this laptop wow it deserve more than 5 stars it run fast and the size is perfect wow wow wow again I didn't expect it would ...", "review_id": "R3T521A2XPQ0ZT", "review_author": " David Marcili", "review_text": "I have no word . I'm speechless for this laptop wow it deserve more than 5 stars it run fast and the size is perfect wow wow wow again I didn't expect it would run fast like that .I love it", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "15 Nov 2017"}, {"review_header": "Four Stars", "review_id": "R2N3K4BC165WVG", "review_author": " Samuel W.", "review_text": "It was gift for a college student and they love it.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "27 Oct 2017"}, {"review_header": "was easy to set up more to", "review_id": "R1QWI32L5FI1KH", "review_author": " Abbe", "review_text": "Just received today, was easy to set up more to follow", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "29 Nov 2017"}]}, {"asin": "B015WXL0C6", "name": "Apple MacBook Air 13.3-Inch Laptop (Intel Core i5 1.6GHz, 128GB Flash, 8GB RAM, OS X El Capitan)", "ratings": {"2 star": "2%", "1 star": "9%", "4 star": "8%", "3 star": "3%", "5 star": "78%"}, "url": "http://www.amazon.com/dp/B015WXL0C6", "price": "$894.73", "reviews": [{"review_header": "Legit! Love it!", "review_id": "R2L9UY9TXFB1ON", "review_author": " Amazon Customer", "review_text": "Today is July 8th, 2017 and my Macbook shipment came on the 16th of June (Right on time btw)] I have had my eyes on a Macbook for the longest time now but that pricing at Best Buy (no different than the Apple Store) was just too much for a 13\" & on top of that, there's the tax! I hadn't even thought about buying it online but it hit me one day to look on Amazon and I am SO glad that I did. The pricing for the exact same product here in store (and without tax!) is CHEAPER. I saved SO much money buying this Macbook here on Amazon and I do NOT regret this purchase one bit! I DID think about it a lot and read every last review and looked at all the product pictures (which were all good) and I'm glad to say that I also got a BRAND NEW PACKAGED BY APPLE MACBOOK AIR 13.3 INCH LAPTOP! It was sealed shut in the original Apple packaging brand new! Everything is running smoothly, no problems whatsoever (though I am VERY nervous of leaving a scratch or something on it so I bought a rubberized case & carrying case to keep it safe & looking new!) NOW, though the product title DOES say that it comes preinstalled with EL CAPTAIN (or whatever), mine already came with the SIERRA update. It had Sierra Version 10.12.3 and in the app store, you can update it (FOR FREE) with the May 2017 recent Sierra 10.12.5 update! IF yours comes in with EL CAPTAIN, you can update it FOR FREE to the 2017 Sierra update - do not worry! Lol. Now I don't see any CONS to this laptop (for ME anyway) but here are my PROS: - Editing is smooth -Battery life is AMAZING. It also charges fast! - Love the simplicity off this laptop! -Everything runs smooth and is simple to access (unless you're coming from windows,etc) - The design - The backlight on the keyboard & apple on back - The screen (which a lot of people complain about but there's nothing wrong with it? Pst picky people!) - Loading screens are quick - Love how it connects to my phone and i can facetime and imessage - Size is perfect - Love how slim and thin it is though I'm sometimes afraid I might drop it lol - Usb ports/sd card slot (This laptop will forever be Apples BEST laptop. Why did they take basically ALL of the ports off of the Pro's?) - Light gaming runs VERY well (for hours) with no problems or restarting & resolution is perfect (I play Sims 4) - There's enough space - Continues to get the latest updates - Magnetic charger (also love how the charger light indicates if it's charged or not) Anyways, there's A LOT that I love about this laptop. I recommend this laptop to anyone who is looking for one! Thanks Apple!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "25 Jun 2017"}, {"review_header": "- Easy to learn and navigate", "review_id": "R22J05NHKNYKT0", "review_author": " HF715", "review_text": "I am a current grad student. I ordered this for school purposes. I have used mac products before and I am impressed with this one. I am not a computer guru, but I know my way around both mac and windows. Pros: -Brilliant display. It's very bright. The keyboard is lit so that helps with late night homework. - Easy to learn and navigate. Even with non-apple products. I downloaded word and it works great on this mac, as does PowerPoint. - Lightweight. This thing is so easy to carry. In my undergrad I had a traditional laptop, and it was so heavy to carry on campus. I have this one in a small sleeve and it is very easy to transport back and forth. - Quiet - this thing does not make a lot of noise when typing. The key stroke isn't as deep, so the click isn't as loud, which is nice when you're in class taking notes. - Excellent sound system - its speakers are clear and LOUD. Great for when you just have to have an impromptu dance party while making dinner with your kids :) - Good battery life - I use this thing daily, and have to charge it about once a week, maybe twice a week depending on how much late night surfing I'm doing. - Fast - it has great processing time. I'm constantly taking pictures on my phone and airdropping them to the MacBook Air (what can I say, my cloud is already full!). It takes literally seconds for this thing to download 35+ pictures. - it has a USB port still. The newer MacBook Pro does not, which would drive me nuts! Cons I will say it can be a bit cumbersome to use the pad. I like a traditional mouse better, but this is easily resolved by attaching a wireless mouse (which I have for this computer - thank you USB port!) It doesn't have a CD drive (bummer for watching dvds/playing cds) Overall I'd say the quality is very good. As a student I am happy with the feautures and the fact that it is so easy to carry around with me.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "11 Jun 2017"}, {"review_header": "Best laptop I've owned", "review_id": "RMVI0UR8J1H22", "review_author": " Drew Nelson", "review_text": "I debated between this macbook air and a MS Surface. I couldn't be happier with my decision to get the MacBook Air. It is incredibly fast, loads quickly, and it is so easy to travel with due to it's size and lightweight. I also bought the Asurion warranty which seems to be a much better deal than AppleCare.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "13 Feb 2017"}, {"review_header": "AMAZING Laptop, but Limited Storage", "review_id": "RK7LV9JZRTPX3", "review_author": " Casia Rose", "review_text": "I love this laptop so much and have had it for over a month, no problems! My only issue is the limited space.. I do YouTube videos so I'm constantly transferring footage and images to and from my laptop, but I often have to delete a lot because it has very limited space. Other than that, no complaints at all!", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "21 May 2017"}, {"review_header": "... it less than A month and it was doing great then One day I opend it and it was ...", "review_id": "R1PDQDP21FH1DW", "review_author": " Ash", "review_text": "I bought it less than A month and it was doing great then One day I opend it and it was like that!! I didn't even do anything I swear. I put all of my money to buy this laptop so I can use it for college and now I can't even afford to fix it.", "review_comment_count": "", "review_rating": "1.0 ", "review_posted_date": "27 Jun 2017"}, {"review_header": "Overall", "review_id": "R1C9NBOGYKDRT", "review_author": " Adianet", "review_text": "Perfect packaging and laptop. It runs fine and exactly how described.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "07 Apr 2017"}, {"review_header": "I love it!", "review_id": "R84HI32YG5NRV", "review_author": " Yuritzi Aguilar", "review_text": "I had been wanting a MacBook for a very long time and my old laptop broke so it was the perfect opportunity. The price is really good for it being brand new (better than going to the Apple Store and getting it for $1299!). It is from 2015 but that really doesn't matter when it is a brand new laptop and you're able to update the OS.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "11 May 2017"}, {"review_header": "Fantastic!", "review_id": "R2029KLEI3TJEB", "review_author": " Michael", "review_text": "EDIT: beware this DOES NOT come with El Capitan only Sierra with free high Sierra upgrade. I use this for school and travel. As a lifetime windows user I was hesitant at first and initially it took me some time getting used to it but I love it now. Very compact, color comes in wonderfully on the screen. It arrived brand new, in the packaging and in good working order. Very satisfied with it.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "11 Dec 2017"}]}, {"asin": "B072QGG3V7", "name": "Apple MNYF2LL/A 12\" MacBook, Retina, 1.2GHz Intel Core m3 Dual Core Processor, 8GB RAM, 256GB SSD, Mac OS, Space Gray (Newest Version)", "ratings": {"4 star": "20%", "5 star": "80%"}, "url": "http://www.amazon.com/dp/B072QGG3V7", "price": "$1239.00", "reviews": [{"review_header": "Five Stars", "review_id": "R2YSX4JMVMUCKE", "review_author": " davi", "review_text": "PERFECT!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "28 Nov 2017"}, {"review_header": "Speed problem solved; still only one USB-C port and no Thunderbolt", "review_id": "R21P4SPXMM2GXG", "review_author": " xgrep", "review_text": "I really wanted to get this MacBook when it was first announced, because I travel a lot and appreciate the smallest package I can find. But, having regretted getting the first gen MacBook Air, I decided to wait. I was concerned about two things: the relatively slow core m processor, and the lack of ports. Before you complain that a lack of ports on a very portable machine shouldn't be a problem, I agree, and it wouldn't be except for one thing: Apple's SuperDrive, which is one of the better outboard optical drives in build quality and performance, hogs USB ports. That is, it won't work through any vendor's USB hub. It only works when plugged directly into a USB-A port on the computer, or when plugged into the single USB-A port on any of the adapters that Apple sells for MacBooks with USB-C ports. It has nothing to do with power (though it does require more power than many hubs supply); it's actually a restriction that Apple support has confirmed to me. So if you like your SuperDrive and want to plug it into your MacBook, no other USB device can be plugged in at the same time. This is a fairly serious restriction. At least the recent MacBook Pro has two USB-C ports, but the 12\" MacBook still only has one. And it's not even a Thunderbolt port, so say goodbye all of your Thunderbolt and Firewire peripherals, no way to use them with this computer (which has always been the case with the 12\" MacBook). BTW, other optical drives work fine on a USB hub, so the port-hogging nature of the SuperDrive shouldn't be a deal-breaker for anyone. Other than that annoyance, I ordered the BTO/CTO version of this MacBook directly from Apple with 16GB memory and the core i7 processor to upgrade from my mid-2014 MacBook Pro with a core i7. I'm very pleased to say that the performance of this new computer is very snappy - I haven't been able to notice any difference between this and the MacBook Pro. I'll be running some performance tests with Xbench and will report back if/when I have a chance, but if you were waiting until a fast enough MacBook 12-inch notebook showed up, this is the one (provided you shell out the extra cash for the core i7). Oh, and don't forget to order that $69 USB-C AV Multiport Adapter. Update 2017-07-05 (see new update - \"glitch\" caused by sleeve!): Beware hardware glitches! After using this for a few weeks, I've discovered a couple of annoying features, one of which might cause me to remove another star, but I'm not ready to do that just yet. The first thing is that this new MacBook, like the latest MacBook Pro models, no longer has the famous Apple \"loud zen\" chime on startup. It's totally silent. This is because it boots (or wakes) automatically when you open the lid, so, for whatever reason, Apple considered that there was no point in having the startup chime. This is mostly not a problem unless, for example, you're trying to reset PRAM (now called NVRAM), where you'd like to hear a chime or two before releasing the magic keys. But the second thing is much more serious, which is that on my unit, the internal switch that detects that the lid has been opened (to boot or wake it) is faulty, and doesn't always work. You can open and close the lid all you want and press the power button 'til the cows come home, but it's not going to work. I found that if I tap it just right, it will free up the switch and work fine. I'm currently traveling and brought it to a Genius Bar and they couldn't find any fix, even after completely reinstalling Mac OS. When I get home, I'm going to open another problem case and ask to have it replaced. I'll report back here if there's anything noteworthy to report on. Update 2017-08-28: After a lot of testing, I finally determined that the \"flakey lid switch\" was being caused by the protective sleeve that I use when traveling: Incase ICON Sleeve with TENSAERLITE for 12\" MacBook - Heather Gray/Black - CL60649 . This sleeve has a magnetic closure that somehow causes the magnetic reed switch in the lid and base to stick in the \"closed\" position. If you tap the MacBook just right, it will free up. As long as I don't put it in the sleeve, it always works fine. I need to do more testing to see if the direction that I insert the MacBook in the sleeve will have any effect, but reed switches are like this, and it's not a defect in the MacBook. Even though there doesn't seem to be any problem, I still feel that this computer really needs more expansion capability and a Thunderbolt 3 port would've been a much better choice than simply a USB 3.0 type-C port. So I'm not going to give it five stars, yet. Maybe, as components get smaller, a future MacBook will have that, at which point this will be a near-perfect product.", "review_comment_count": "", "review_rating": "4.0 ", "review_posted_date": "15 Jun 2017"}, {"review_header": "Huge bang for the buck", "review_id": "R3EEGRWTGX7KPQ", "review_author": " Ken Warner", "review_text": "I bought this for my wife for her birthday to replace her old, clunky laptop. It's amazing how thin and light it is--perfect for her to tote back and forth to her office. It's just as fast, if not faster than my 2013 MBP, with twice as much RAM and SSD space as that machine. I'm more the power user in the family, but honestly, this machine would work for me too. I'd read that the CPU on the 1st gen 12\" MBs were a bit laggy, but that's not the case at all on this 2nd gen model! Very pleased.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "20 Aug 2017"}, {"review_header": "maybe best I've ever heard on a laptop)", "review_id": "R332XR86BWNR2I", "review_author": " D. D. Larsen", "review_text": "Somehow, I prefer the 2017 Macbook 12\" i5 to my previous 2016 MacBook Pro Retina Touchbar i5. My Pro seems to not be as \"snappy\" in day to day usage, especially when streaming 4k video and even office tasks. The battery life is really impressive on the 12\"er and I finally \"get it\". I didn't understand where this MacBook had a place between the Air and the Pro line, but now it makes sense. It truly is the replacement for the Air line, and with this screen, these speakers (Incredible, maybe best I've ever heard on a laptop), this performance, and this battery life its possibly the most well balanced laptop Ive ever owned. And I've probably owned 50. 2lbs, crazy light and enough horsepower for 90% of users. Expensive, but the best build quality and experience in my opinion in the market. Well done Apple. You converted a longtime PC Fanboy.", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "09 Sep 2017"}, {"review_header": "Great for her school work", "review_id": "R3MXM5K1GT775Z", "review_author": " Edna Smith", "review_text": "Bought it for my granddaughter! Great for her school work!", "review_comment_count": "", "review_rating": "5.0 ", "review_posted_date": "09 Sep 2017"}]}]